namespace Kesco.Lib.BaseExtention.Enums.Docs
{
    /// <summary>
    ///     Поведение класса BaseDocFacade при установке set значения
    /// </summary>
    public enum BaseSetBehavior
    {
        /// <summary>
        ///     Простая установка значения, добавление в коллекцию по порядку
        /// </summary>
        SetBaseDoc,

        /// <summary>
        ///     Установка значения: сначала удаление всех значений, потом добавление
        /// </summary>
        RemoveAllAndAddDoc
    }

    /// <summary>
    ///     Напаравление документа
    /// </summary>
    public enum DocDirs
    {
        /// <summary>
        ///     Направление не определено
        /// </summary>
        Undefined = 0,

        /// <summary>
        ///     Входящий документ
        /// </summary>
        In = 1,

        /// <summary>
        ///     Исходящий документ
        /// </summary>
        Out = 2
    }

    /// <summary>
    ///     Тип поиска
    /// </summary>
    public enum SearchType
    {
        /// <summary>
        ///     Совпадает
        /// </summary>
        Equals = 0,

        /// <summary>
        ///     Содержит
        /// </summary>
        Contain = 1,

        /// <summary>
        ///     Начинается с
        /// </summary>
        StartWith = 2
    }

    /// <summary>
    ///     Типы автогенерации номера документа
    /// </summary>
    public enum NumGenTypes
    {
        /// <summary>
        ///     Автогенерация не требуется
        /// </summary>
        CanNotBeGenerated = 0,

        /// <summary>
        ///     Автогенерация по требованию
        /// </summary>
        CanBeGenerated = 1,

        /// <summary>
        ///     Обязательная автогенерация(программа сама генирирует номер)
        /// </summary>
        MustBeGenerated = 2
    }

    /// <summary>
    ///     Перечисление типов документа
    /// </summary>
    /// <example>
    ///     чтобы получить значение Id например: var type = (int)DocTypeEnum.Приказ;
    /// </example>
    /// <remarks>чтобы получить значение Id</remarks>
    public enum DocTypeEnum
    {
        /// <summary>
        ///     тип не указан
        /// </summary>
        ТипНеУказан = 0,

        /// <summary>
        ///     Приказ
        /// </summary>
        Приказ = 2038,

        /// <summary>
        ///     Договор
        /// </summary>
        Договор = 2039,

        /// <summary>
        ///     Поручение
        /// </summary>
        Поручение = 2063,

        /// <summary>
        ///     Рисунок
        /// </summary>
        Рисунок = 2064,

        /// <summary>
        ///     Карта
        /// </summary>
        Карта = 2065,

        /// <summary>
        ///     Платежное поручение
        /// </summary>
        ПлатежноеПоручение = 2066,

        /// <summary>
        ///     Счет-фактура
        /// </summary>
        СчетФактура = 2070,

        /// <summary>
        ///     Инвойс
        /// </summary>
        Инвойс = 2071,

        /// <summary>
        ///     Аккредитив, LCI
        /// </summary>
        АккредитивLci = 2073,

        /// <summary>
        ///     Гарантия
        /// </summary>
        Гарантия = 2074,

        /// <summary>
        ///     Акт
        /// </summary>
        Акт = 2076,

        /// <summary>
        ///     Акт сверки
        /// </summary>
        АктСверки = 2077,

        /// <summary>
        ///     Акт выполненных работ, услуг
        /// </summary>
        АктВыполненныхРаботУслуг = 2078,

        /// <summary>
        ///     Акт приема-передачи
        /// </summary>
        АктПриемаПередачи = 2079,

        /// <summary>
        ///     Акт приема-передачи товара
        /// </summary>
        АктПриемаПередачиТовара = 2080,

        /// <summary>
        ///     Акт приема-передачи векселей
        /// </summary>
        АктПриемаПередачиВекселей = 2081,

        /// <summary>
        ///     Анкета
        /// </summary>
        Анкета = 2082,

        /// <summary>
        ///     Резюме
        /// </summary>
        Резюме = 2083,

        /// <summary>
        ///     Реквизиты
        /// </summary>
        Реквизиты = 2084,

        /// <summary>
        ///     Отчет
        /// </summary>
        Отчет = 2085,

        /// <summary>
        ///     Баланс
        /// </summary>
        Баланс = 2086,

        /// <summary>
        ///     Отчет по договору
        /// </summary>
        ОтчетПоДоговору = 2087,

        /// <summary>
        ///     Авансовый отчет
        /// </summary>
        АвансовыйОтчет = 2089,

        /// <summary>
        ///     Акт выработки
        /// </summary>
        АктВыработки = 2090,

        /// <summary>
        ///     Декларация
        /// </summary>
        Декларация = 2091,

        /// <summary>
        ///     Ведомость
        /// </summary>
        Ведомость = 2095,

        /// <summary>
        ///     Вексель
        /// </summary>
        Вексель = 2097,

        /// <summary>
        ///     Выписка
        /// </summary>
        Выписка = 2098,

        /// <summary>
        ///     График
        /// </summary>
        График = 2099,

        /// <summary>
        ///     Доверенность
        /// </summary>
        Доверенность = 2100,

        /// <summary>
        ///     Приложение
        /// </summary>
        Приложение = 2110,

        /// <summary>
        ///     Соглашение
        /// </summary>
        Соглашение = 2111,

        /// <summary>
        ///     Жалоба
        /// </summary>
        Жалоба = 2112,

        /// <summary>
        ///     Заявка
        /// </summary>
        Заявка = 2114,

        /// <summary>
        ///     Заявление
        /// </summary>
        Заявление = 2115,

        /// <summary>
        ///     Предложение
        /// </summary>
        Предложение = 2116,

        /// <summary>
        ///     Подтверждение
        /// </summary>
        Подтверждение = 2120,

        /// <summary>
        ///     Инкассовое поручение
        /// </summary>
        ИнкассовоеПоручение = 2122,

        /// <summary>
        ///     Требование
        /// </summary>
        Требование = 2124,

        /// <summary>
        ///     Платежное требование
        /// </summary>
        ПлатежноеТребование = 2125,

        /// <summary>
        ///     Отказ
        /// </summary>
        Отказ = 2127,

        /// <summary>
        ///     Инструкция
        /// </summary>
        Инструкция = 2128,

        /// <summary>
        ///     Лист
        /// </summary>
        Лист = 2129,

        /// <summary>
        ///     Список
        /// </summary>
        Список = 2131,

        /// <summary>
        ///     Тариф
        /// </summary>
        Тариф = 2132,

        /// <summary>
        ///     Смета
        /// </summary>
        Смета = 2133,

        /// <summary>
        ///     Спецификация
        /// </summary>
        Спецификация = 2134,

        /// <summary>
        ///     Калькуляция
        /// </summary>
        Калькуляция = 2135,

        /// <summary>
        ///     Квитанция
        /// </summary>
        Квитанция = 2137,

        /// <summary>
        ///     Расписка
        /// </summary>
        Расписка = 2138,

        /// <summary>
        ///     Квитанция о приеме груза к перевозке
        /// </summary>
        КвитанцияОПриемеГрузаКПеревозке = 2139,

        /// <summary>
        ///     ЖД квитанция
        /// </summary>
        ЖдКвитанция = 2140,

        /// <summary>
        ///     Коносамент
        /// </summary>
        Коносамент = 2141,

        /// <summary>
        ///     Авиа квитанция
        /// </summary>
        АвиаКвитанция = 2142,

        /// <summary>
        ///     Накладная
        /// </summary>
        Накладная = 2143,

        /// <summary>
        ///     ЖД накладная
        /// </summary>
        ЖдНакладная = 2144,

        /// <summary>
        ///     Товарно-транспортная накладная
        /// </summary>
        ТоварноТранспортнаяНакладная = 2145,

        /// <summary>
        ///     Устав
        /// </summary>
        Устав = 2147,

        /// <summary>
        ///     Лицензия
        /// </summary>
        Лицензия = 2148,

        /// <summary>
        ///     Свидетельство
        /// </summary>
        Свидетельство = 2149,

        /// <summary>
        ///     Решение
        /// </summary>
        Решение = 2150,

        /// <summary>
        ///     Указание
        /// </summary>
        Указание = 2152,

        /// <summary>
        ///     Распоряжение
        /// </summary>
        Распоряжение = 2153,

        /// <summary>
        ///     Постановление
        /// </summary>
        Постановление = 2154,

        /// <summary>
        ///     Предписание
        /// </summary>
        Предписание = 2155,

        /// <summary>
        ///     Протокол
        /// </summary>
        Протокол = 2156,

        /// <summary>
        ///     Заключение
        /// </summary>
        Заключение = 2157,

        /// <summary>
        ///     Маршрутное поручение (маршрутная телеграмма)
        /// </summary>
        МаршрутноеПоручениеМаршрутнаяТелеграмма = 2159,

        /// <summary>
        ///     Разрешение
        /// </summary>
        Разрешение = 2160,

        /// <summary>
        ///     Ордер
        /// </summary>
        Ордер = 2161,

        /// <summary>
        ///     Отзыв
        /// </summary>
        Отзыв = 2162,

        /// <summary>
        ///     Паспорт
        /// </summary>
        Паспорт = 2163,

        /// <summary>
        ///     Паспорт товара
        /// </summary>
        ПаспортТовара = 2164,

        /// <summary>
        ///     Паспорт качества
        /// </summary>
        ПаспортКачества = 2165,

        /// <summary>
        ///     Паспорт сделки
        /// </summary>
        ПаспортСделки = 2166,

        /// <summary>
        ///     Паспорт гражданина
        /// </summary>
        ПаспортГражданина = 2167,

        /// <summary>
        ///     Экспликация
        /// </summary>
        Экспликация = 2168,

        /// <summary>
        ///     План
        /// </summary>
        План = 2169,

        /// <summary>
        ///     Сертификат
        /// </summary>
        Сертификат = 2171,

        /// <summary>
        ///     Повестка
        /// </summary>
        Повестка = 2172,

        /// <summary>
        ///     Уведомление
        /// </summary>
        Уведомление = 2173,

        /// <summary>
        ///     Авизо
        /// </summary>
        Авизо = 2174,

        /// <summary>
        ///     Подписка
        /// </summary>
        Подписка = 2175,

        /// <summary>
        ///     Претензия
        /// </summary>
        Претензия = 2176,

        /// <summary>
        ///     Приглашение
        /// </summary>
        Приглашение = 2177,

        /// <summary>
        ///     Справка
        /// </summary>
        Справка = 2178,

        /// <summary>
        ///     Удостоверение
        /// </summary>
        Удостоверение = 2179,

        /// <summary>
        ///     Билет
        /// </summary>
        Билет = 2180,

        /// <summary>
        ///     Ходатайство
        /// </summary>
        Ходатайство = 2181,

        /// <summary>
        ///     Platss european marketscan
        /// </summary>
        PlatssEuropeanMarketscan = 2186,

        /// <summary>
        ///     Бюллетень
        /// </summary>
        Бюллетень = 2187,

        /// <summary>
        ///     Карточка
        /// </summary>
        Карточка = 2191,

        /// <summary>
        ///     Полис
        /// </summary>
        Полис = 2192,

        /// <summary>
        ///     Закладная
        /// </summary>
        Закладная = 2193,

        /// <summary>
        ///     Акция
        /// </summary>
        Акция = 2212,

        /// <summary>
        ///     Чек
        /// </summary>
        Чек = 2213,

        /// <summary>
        ///     Облигация
        /// </summary>
        Облигация = 2214,

        /// <summary>
        ///     Записка
        /// </summary>
        Записка = 2216,

        /// <summary>
        ///     Пояснительная записка
        /// </summary>
        ПояснительнаяЗаписка = 2217,

        /// <summary>
        ///     Служебная записка
        /// </summary>
        СлужебнаяЗаписка = 2218,

        /// <summary>
        ///     Объяснительная записка
        /// </summary>
        ОбъяснительнаяЗаписка = 2219,

        /// <summary>
        ///     Ответ
        /// </summary>
        Ответ = 2221,

        /// <summary>
        ///     Отмена
        /// </summary>
        Отмена = 2222,

        /// <summary>
        ///     Образец
        /// </summary>
        Образец = 2225,

        /// <summary>
        ///     Правила
        /// </summary>
        Правила = 2226,

        /// <summary>
        ///     Кодекс
        /// </summary>
        Кодекс = 2227,

        /// <summary>
        ///     Положение
        /// </summary>
        Положение = 2228,

        /// <summary>
        ///     Стандарт
        /// </summary>
        Стандарт = 2229,

        /// <summary>
        ///     Условия
        /// </summary>
        Условия = 2230,

        /// <summary>
        ///     Сборник
        /// </summary>
        Сборник = 2231,

        /// <summary>
        ///     Заказ
        /// </summary>
        Заказ = 2233,

        /// <summary>
        ///     Запрос
        /// </summary>
        Запрос = 2234,

        /// <summary>
        ///     Прейскурант
        /// </summary>
        Прейскурант = 2235,

        /// <summary>
        ///     Прайс-лист
        /// </summary>
        ПрайсЛист = 2236,

        /// <summary>
        ///     Процессинг
        /// </summary>
        Процессинг = 2237,

        /// <summary>
        ///     Расчет
        /// </summary>
        Расчет = 2238,

        /// <summary>
        ///     Тарифы на услуги
        /// </summary>
        ТарифыНаУслуги = 2239,

        /// <summary>
        ///     Листок
        /// </summary>
        Листок = 2241,

        /// <summary>
        ///     Исполнительный лист
        /// </summary>
        ИсполнительныйЛист = 2243,

        /// <summary>
        ///     Листок нетрудоспособности
        /// </summary>
        ЛистокНетрудоспособности = 2244,

        /// <summary>
        ///     Перечень
        /// </summary>
        Перечень = 2245,

        /// <summary>
        ///     Номенклатура
        /// </summary>
        Номенклатура = 2246,

        /// <summary>
        ///     Опись
        /// </summary>
        Опись = 2247,

        /// <summary>
        ///     Расписание
        /// </summary>
        Расписание = 2248,

        /// <summary>
        ///     Реестр
        /// </summary>
        Реестр = 2249,

        /// <summary>
        ///     Фактура
        /// </summary>
        Фактура = 2250,

        /// <summary>
        ///     Табель
        /// </summary>
        Табель = 2251,

        /// <summary>
        ///     Схема
        /// </summary>
        Схема = 2253,

        /// <summary>
        ///     Фотография
        /// </summary>
        Фотография = 2254,

        /// <summary>
        ///     Акцепт
        /// </summary>
        Акцепт = 2256,

        /// <summary>
        ///     Согласие
        /// </summary>
        Согласие = 2257,

        /// <summary>
        ///     Диплом
        /// </summary>
        Диплом = 2258,

        /// <summary>
        ///     Swift
        /// </summary>
        Swift = 2259,

        /// <summary>
        ///     Оферта
        /// </summary>
        Оферта = 2261,

        /// <summary>
        ///     Проспект
        /// </summary>
        Проспект = 2262,

        /// <summary>
        ///     Просьба
        /// </summary>
        Просьба = 2263,

        /// <summary>
        ///     Определение
        /// </summary>
        Определение = 2266,

        /// <summary>
        ///     Задание
        /// </summary>
        Задание = 2267,

        /// <summary>
        ///     Задание на платеж
        /// </summary>
        ЗаданиеНаПлатеж = 2269,

        /// <summary>
        ///     Сообщение
        /// </summary>
        Сообщение = 2271,

        /// <summary>
        ///     Извещение
        /// </summary>
        Извещение = 2272,

        /// <summary>
        ///     Напоминание
        /// </summary>
        Напоминание = 2273,

        /// <summary>
        ///     Листовка
        /// </summary>
        Листовка = 2274,

        /// <summary>
        ///     Афиша
        /// </summary>
        Афиша = 2275,

        /// <summary>
        ///     Объявление
        /// </summary>
        Объявление = 2276,

        /// <summary>
        ///     Анонс
        /// </summary>
        Анонс = 2277,

        /// <summary>
        ///     Дополнение
        /// </summary>
        Дополнение = 2280,

        /// <summary>
        ///     Изменение
        /// </summary>
        Изменение = 2281,

        /// <summary>
        ///     Счет
        /// </summary>
        Счет = 2283,

        /// <summary>
        ///     Инвойс-проформа
        /// </summary>
        ИнвойсПроформа = 2284,

        /// <summary>
        ///     Прошение
        /// </summary>
        Прошение = 2286,

        /// <summary>
        ///     Поручительство
        /// </summary>
        Поручительство = 2288,

        /// <summary>
        ///     Сведения
        /// </summary>
        Сведения = 2293,

        /// <summary>
        ///     Служебная записка на рублёвую оплату
        /// </summary>
        СлужебнаяЗапискаНаРублёвуюОплату = 2294,

        /// <summary>
        ///     Служебная записка на валютную оплату
        /// </summary>
        СлужебнаяЗапискаНаВалютнуюОплату = 2295,

        /// <summary>
        ///     Акт приема-передачи - перемещения со склада на склад
        /// </summary>
        АктПриемаПередачиПеремещенияСоСкладаНаСклад = 2297,

        /// <summary>
        ///     Заявка на покупку
        /// </summary>
        ЗаявкаНаПокупку = 2299,

        /// <summary>
        ///     Договор поставки
        /// </summary>
        ДоговорПоставки = 2300,

        /// <summary>
        ///     Договор комиссии
        /// </summary>
        ДоговорКомиссии = 2301,

        /// <summary>
        ///     Контракт
        /// </summary>
        Контракт = 2303,

        /// <summary>
        ///     Договор оказания услуг
        /// </summary>
        ДоговорОказанияУслуг = 2304,

        /// <summary>
        ///     Договор купли-продажи
        /// </summary>
        ДоговорКуплиПродажи = 2305,

        /// <summary>
        ///     Договор аренды
        /// </summary>
        ДоговорАренды = 2306,

        /// <summary>
        ///     Договор агентирования
        /// </summary>
        ДоговорАгентирования = 2307,

        /// <summary>
        ///     Договор хранения
        /// </summary>
        ДоговорХранения = 2308,

        /// <summary>
        ///     Договор транспортной экспедиции
        /// </summary>
        ДоговорТранспортнойЭкспедиции = 2309,

        /// <summary>
        ///     Договор транспортировки
        /// </summary>
        ДоговорТранспортировки = 2310,

        /// <summary>
        ///     Договор подряда
        /// </summary>
        ДоговорПодряда = 2311,

        /// <summary>
        ///     Договор займа (ресурсов)
        /// </summary>
        ДоговорЗаймаРесурсов = 2312,

        /// <summary>
        ///     Договор займа (денежного)
        /// </summary>
        ДоговорЗаймаДенежного = 2313,

        /// <summary>
        ///     Анализ
        /// </summary>
        Анализ = 2315,

        /// <summary>
        ///     Исследование
        /// </summary>
        Исследование = 2316,

        /// <summary>
        ///     Банковская выписка
        /// </summary>
        БанковскаяВыписка = 2317,

        /// <summary>
        ///     Акт приема-передачи нефти
        /// </summary>
        АктПриемаПередачиНефти = 2318,

        /// <summary>
        ///     Акт приема-передачи в переработку
        /// </summary>
        АктПриемаПередачиВПереработку = 2319,

        /// <summary>
        ///     Заявка заводу на отгрузку продуктов
        /// </summary>
        ЗаявкаЗаводуНаОтгрузкуПродуктов = 2320,

        /// <summary>
        ///     Заявка на заказ плана ЖД
        /// </summary>
        ЗаявкаНаЗаказПланаЖд = 2321,

        /// <summary>
        ///     Заявка на заказ трубы
        /// </summary>
        ЗаявкаНаЗаказТрубы = 2322,

        /// <summary>
        ///     ЖД реестр
        /// </summary>
        ЖдРеестр = 2323,

        /// <summary>
        ///     Приложение к договору
        /// </summary>
        ПриложениеКДоговору = 2324,

        /// <summary>
        ///     Служебная записка на рублевую оплату нерезиденту
        /// </summary>
        СлужебнаяЗапискаНаРублевуюОплатуНерезиденту = 2327,

        /// <summary>
        ///     Служебная записка на оплату налогов
        /// </summary>
        СлужебнаяЗапискаНаОплатуНалогов = 2328,

        /// <summary>
        ///     Служебная записка на оплату налогов с ФОТ
        /// </summary>
        СлужебнаяЗапискаНаОплатуНалоговСФот = 2329,

        /// <summary>
        ///     Книга покупок
        /// </summary>
        КнигаПокупок = 2333,

        /// <summary>
        ///     Книга продаж
        /// </summary>
        КнигаПродаж = 2334,

        /// <summary>
        ///     Технические условия
        /// </summary>
        ТехническиеУсловия = 2335,

        /// <summary>
        ///     Техническое задание
        /// </summary>
        ТехническоеЗадание = 2336,

        /// <summary>
        ///     TAN
        /// </summary>
        TAN = 2337,

        /// <summary>
        ///     Акт списания
        /// </summary>
        АктСписания = 2338,

        /// <summary>
        ///     Мемориальный ордер
        /// </summary>
        МемориальныйОрдер = 2339,

        /// <summary>
        ///     Договор кредита
        /// </summary>
        ДоговорКредита = 2340,

        /// <summary>
        ///     Договор уступки
        /// </summary>
        ДоговорУступки = 2341,

        /// <summary>
        ///     Договор банковской гарантии
        /// </summary>
        ДоговорБанковскойГарантии = 2342,

        /// <summary>
        ///     Таможенная декларация
        /// </summary>
        ТаможеннаяДекларация = 2343,

        /// <summary>
        ///     Договор перевода долга
        /// </summary>
        ДоговорПереводаДолга = 2344,

        /// <summary>
        ///     Акт слива нефтепродуктов
        /// </summary>
        АктСливаНефтепродуктов = 2349,

        /// <summary>
        ///     Служебная записка на заказ ЖД плана
        /// </summary>
        СлужебнаяЗапискаНаЗаказЖдПлана = 2350,

        /// <summary>
        ///     Инструкция по заполнению ЖД накладных
        /// </summary>
        ИнструкцияПоЗаполнениюЖдНакладных = 2351,

        /// <summary>
        ///     Договор дарения
        /// </summary>
        ДоговорДарения = 2352,

        /// <summary>
        ///     Заявление на отпуск
        /// </summary>
        ЗаявлениеНаОтпуск = 2353,

        /// <summary>
        ///     Заявление на перевод
        /// </summary>
        ЗаявлениеНаПеревод = 2354,

        /// <summary>
        ///     Договор учредительный
        /// </summary>
        ДоговорУчредительный = 2355,

        /// <summary>
        ///     Указание в отдел ИТ на организацию рабочего места
        /// </summary>
        УказаниеВОтделИтНаОрганизациюРабочегоМеста = 2356,

        /// <summary>
        ///     Указание на приём сотрудника на работу
        /// </summary>
        УказаниеНаПриёмСотрудникаНаРаботу = 2357,

        /// <summary>
        ///     SIM карта
        /// </summary>
        SimКарта = 2358,

        /// <summary>
        ///     Дорожная ведомость
        /// </summary>
        ДорожнаяВедомость = 2359,

        /// <summary>
        ///     Акт приёма к учёту основного средства
        /// </summary>
        АктПриёмаКУчётуОсновногоСредства = 2360,

        /// <summary>
        ///     Акт КС-2
        /// </summary>
        АктКс2 = 2361,

        /// <summary>
        ///     Акт расчет зерна
        /// </summary>
        АктРасчетЗерна = 2362,

        /// <summary>
        ///     Акт приема-передачи зерна
        /// </summary>
        АктПриемаПередачиЗерна = 2363,

        /// <summary>
        ///     ЖД накладные/квитанции перечень
        /// </summary>
        ЖдНакладныеКвитанцииПеречень = 2364,

        /// <summary>
        ///     Акт списания оборудования
        /// </summary>
        АктСписанияОборудования = 2365,

        /// <summary>
        ///     Речная квитанция
        /// </summary>
        РечнаяКвитанция = 2366,

        /// <summary>
        ///     Транспортная накладная
        /// </summary>
        ТранспортнаяНакладная = 2367,

        /// <summary>
        ///     Заявка на отгрузку
        /// </summary>
        ЗаявкаНаОтгрузку = 2368,

        /// <summary>
        ///     Накладная на отпуск материалов на сторону
        /// </summary>
        НакладнаяНаОтпускМатериаловНаСторону = 2370,

        /// <summary>
        ///     Речная накладная
        /// </summary>
        РечнаяНакладная = 2371,

        /// <summary>
        ///     Соглашение оказания услуг
        /// </summary>
        СоглашениеОказанияУслуг = 2372,

        /// <summary>
        ///     Патент
        /// </summary>
        Патент = 2373,

        /// <summary>
        ///     Трудовой договор
        /// </summary>
        ТрудовойДоговор = 2374,

        /// <summary>
        ///     Презентация
        /// </summary>
        Презентация = 2375,

        /// <summary>
        ///     Заявка на приобретение МТР
        /// </summary>
        ЗаявкаНаПриобретениеМТР = 2376
    }

    /// <summary>
    ///     Перечисление типов запроса по типу документа
    /// </summary>
    public enum DocTypeQueryType
    {
        /// <summary>
        ///     Запрос по конкретному типу документа
        /// </summary>
        Equals = 0,

        /// <summary>
        ///     Запрос по типу документа с дочерними типами
        /// </summary>
        WithChildren = 1,

        /// <summary>
        ///     Запрос по типу документа с синонимами
        /// </summary>
        WithSynonyms = 2,

        /// <summary>
        ///     Запрос по типу документа с дочерними типами и синонимами
        /// </summary>
        WithChildrenSynonyms = 3
    }

    /// <summary>
    ///     Перечень типов валидности
    /// </summary>
    public enum ValidAtStatuses
    {
        /// <summary>
        ///     действительный
        /// </summary>
        Valid,

        /// <summary>
        ///     недействительный
        /// </summary>
        NotValid,

        /// <summary>
        ///     еще не действительный
        /// </summary>
        NotValidYet,

        /// <summary>
        ///     уже не действительный
        /// </summary>
        NotValidAlready,

        /// <summary>
        ///     неразрешимый
        /// </summary>
        Undecidable
    }

    /// <summary>
    ///     Тип связанного документа
    /// </summary>
    public enum MtrChildType
    {
        /// <summary>
        ///     Общие
        /// </summary>
        Общие = 0,

        /// <summary>
        ///     Документ Основание Платежа
        /// </summary>
        ДокументОснованиеПлатежа = 1,

        /// <summary>
        ///     Документ Оплаты
        /// </summary>
        ДокументОплаты = 2,

        /// <summary>
        ///     Документ ТТН
        /// </summary>
        ДокументТТН = 3
    }

    /// <summary>
    ///     Типы связи документов
    /// </summary>
    public enum LinkedDocsType
    {
        /// <summary>
        ///     Все основания документа
        /// </summary>
        AllReasons = 0,

        /// <summary>
        ///     Непосредственные основания документа
        /// </summary>
        DirectReasons = 1,

        /// <summary>
        ///     Все вытекающие документы
        /// </summary>
        AllСonsequences = 2,

        /// <summary>
        ///     Непосредственные вытекающие документы
        /// </summary>
        DirectСonsequences = 3
    }

    /// <summary>
    ///     Перечисление наиболее используемых типов контактов
    /// </summary>
    public enum ContactTypeEnum
    {
        /// <summary>
        ///     Телефон Мобильный
        /// </summary>
        ТелефонМобильный = 22,

        /// <summary>
        ///     Email
        /// </summary>
        Email = 40,

        /// <summary>
        ///     Web Сайт
        /// </summary>
        WebСайт = 50
    }

    /// <summary>
    ///     Типы сохранения параметров приложения
    /// </summary>
    public enum AppParamType
    {
        /// <summary>
        ///     не сохраняемый
        /// </summary>
        NotSaved = 0,

        /// <summary>
        /// </summary>
        SavedWithClid = 1,

        /// <summary>
        ///     всегда сохрняется
        /// </summary>
        AlwaysSaved = 2
    }


    #region Электронные формы

    /// <summary>
    ///     Варианты организации работы
    /// </summary>
    public enum DirectionsSotrudnikParentBitEnum
    {
        /// <summary>
        ///     Выдать права как у сотрудника
        /// </summary>
        КакУСотрудника = 1,

        /// <summary>
        ///     Заменить права, почтовые ящики и т.д. на указанного сотрудника
        /// </summary>
        ВместоСотрудника = 2
    }

    /// <summary>
    ///     Варианты организации работы
    /// </summary>
    public enum DirectionsWorkPlaceTypeBitEnum
    {
        /// <summary>
        ///     Организовать сотруднику рабочее место в офисе
        /// </summary>
        РабочееМестоВОфисе = 1,

        /// <summary>
        ///     Организовать сотруднику рабочее место вне офиса
        /// </summary>
        РабочееМестоВнеОфиса = 2,

        /// <summary>
        ///     Организовать сотруднику доступ к корпоративной сети через Internet
        /// </summary>
        УчетнаяЗаписьБезРабочегоМеста = 4
    }

    #endregion
}